OpenFOAM-3.0.0/tutorials/combustion/fireFoam/les/smallPoolFire3D/constant/pyrolysisZones
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          false;

    pyrolysisModel  none;

    regionName      panelRegion;

    reactingOneDimCoeffs
    {
        radFluxName     Qr;

        minimumDelta    1e-8;

        moveMesh        false;
    }

    infoOutput      false;
}


// ************************************************************************* //
